#2) შექმენით 4 ცვლადი თითოეულ მათგანს მნიშვნელობად მიანიჭეთ განსხავებული რიცხვები შემდეგ კი ამ რიცხვებით რომლებსაც ინახავთ ცვლადებში ყველა შესაძლო კომბინაციით შეასრულეთ ოთხი მათემატიკური მოქმედება: მიმატება, გამოკლება, გამრავლება, გაყოფა ისე რომ დაიბეჭდოს თვითონ მოქმედება და პასუხი მაგ. ავიღოთ ორი რიცხვი 3 და 4 ამ ორი რიცხვის შემთხვევაში შედექი იქნება 3 + 4 = 7
# 3 - 4 = -1 და ასე შემდეგ ყველა შესაძლო რიცხვების კომბინაციით და მოქმედებით, რეალური მაგალითი გავაკეთეთ გაკვეთილზე

num1 = 5
num2 = 10
num3 = 15
num4 = 20

print(str(num1) + " + " + str(num2) + " = " + str(num1 + num2))
print(str(num3) + " - " + str(num4) + " = " + str(num3 - num4))
print(str(num3) + " : " + str(num4) + " = " + str(num3 / num4))
print(str(num3) + " x " + str(num4) + " = " + str(num3 * num4))




#4) დაბეჭდეთ ტერმინალში როგორ მოხვდით გოაში თქვენი ისტორია, ამართლებს თუარა თქვენს მოლოდინებს რა შთაბეჭდილებები დაგიტკვათ და ასე შემდეგ დაწერეთ ვრცლად 

print("ki namdvilad amartlebs")