# დაბეჭდე რიცხვები 1-დან 10-მდე:


# i=1

# while i<10:
#     print(i)
#     i+=1

# დაბეჭდე ლუწი რიცხვები 2-დან 20-მდე:


# i=2

# while i<20:
#     print(i)
#     i+=2

# დაითვალე 1-დან 50-მდე რიცხვების ჯამი:

# i = 1
# sum = 0  

# while i < 50:
#     sum += i  
#     i += 1  

# print(sum)
    

# დაბეჭდე 1-დან 10-მდე რიცხვების კვადრატები:


# i=1

# while i<10:
#     square=i**2
#     i+=1
#     print(square)

# 1-დან 100-მდე ლუწი რიცხვების ჯამი:


# i = 1
# sum = 0

# while i < 100:
#     if i % 2 == 0:
#         sum += i
#     i += 1

# print(sum)


# დაბეჭდე 1-დან 30-მდე რიცხვები, რომლებიც იყოფა 3-ზე:

# i=1

# while i<30:
#     if i%3==0:
#         print(i)
#     i+=1

# გააკეთე უკუთვლა 5-დან 1-მდე:

# i=5

# while i>1:
#     print(i)
#     i-=1

# დაითვალე რიცხვების კუბები 1-დან 50-მდე:


# i=1

# while i< 50:
#     cube=i**3
#     i+=1
#     print(cube)

# დაბეჭდე რიცხვები 1-დან 30-მდე, რომლებიც იყოფა 4-ზე

# i=1

# while i<30:
#     if i%4==0:
#         print(i)
#     i+=1