#ერთიდან 100 მდე დაბეჭდეთ ყველა რიცხვი while loop ის გამოყენებით 

# i=1

# while i<100:
#     print(i)
#     i+=1

#2) ერთიდან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი while loop ის გამოყენებით if ების გარეშე 


# i=2

# while i<100:
#     print(i)  
#     i+=2

# ერთიდან 100 მდე დაბეჭდეთ ყველა ლუწი რიცხვი while loop ის გამოყენებით if ების გამოყენებით

# i=2

# while i<100:
#     if i%2==0:
#         print(i)
#     i+=1



 #4) ერთიდან 100 მდე დაბეჭდეთ ყველა რიცხვი თან გვერძე მიუწერეთ ლუწია თუ კენტი  while loop ის გამოყენები


# i=1

# while i<100:
#     if i%2==0:
#         print(i,"even")
#     else:
#         print(i,"odd")
#     i+=1


#    1) დაბეჭდეთ 1 დან 50 მდე რიცხვები while loop ის გამოყენებით

i=1

# while i<50:
#     print(i)
#     i+=1

#      2) დაბეჭდეთ 1 დან 50 მდე მხოლოდ ლუწი რიცხვები if else ის გამოყენების გარეშე

# i=0

# while i<50:
#     print(i)
#     i+=2

#      3) დაბეჭდეთ 1 დან 50 მდე მხოლოდ კენტი რიცხვები if else ის გამოყენების გარეშე

# i=1

# while i<50:
#     print(i)
#     i+=2

#      4) დაბეჭდეთ 10 დან 20მდე რიცხვები while loop ის გამოყენებით

# i-10

# while i<20:
#     print(i)
#     i+=1

#      5) დაბეჭდეთ 5 დან 30 მდე ყველა ლუწი რიცხვი while loop ის და if else გამოყენებით

i=5

# while i<30:
#     if i %2==0:
#         print(i)
#     i+=1

#      6) დაბეჭდეთ 10 დან 35 მდე ყველა კენტი რიცხვი while loop ის და if else გამოყენებით


# i=10


# while i<35:
#     if i%2==1:
#         print(i)
#     i+=1


#      7) დაბეჭდეთ 100 დან 200 მდე ყველა რიცხვი გვერძე კი მიუწერეთ ლუწია თუ კენტი გამოიყენეთ while loop და if else

# i=100

# while i<200:
#     if i%2==0:
#         print(i,"even")
#     else:
#         print(i,"odd")
#     i+=1

#      8) დაბეჭდეთ 50 დან 100 მდე ყველა 5ის ჯერადი რიცხვები while loop ის გამოყენებით

i=50

while i<50:
    print(i)
    i+=5




#      9) დაბეჭდეთ 20 დან 70 მდე ყველა 3ის ჯერადი რიცხვები while loop ის გამოყენებით

# i=20

# while i<70:
#     if i%3==0:
#         print(i)
#     i+=1





#      10) დაბეჭდეთ 1 დან 100 მდე დაბეჭდეთ მხოლოდ ის რიცხვები რომლებიც 3 ჯერადიც არის და 5 ჯერადიც



for i in range(i):
    if i%3==0 and i%5==0:
        print(i)