# 1) შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. დაბეჭდე ცვლადის მნიშვნელობა.
#2)შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.

#3)შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.

#4)შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.

#5)შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.  

#6) შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე

#7) შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ

#8) შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.


my_number=10
print(my_number)

my_text=("hello world")
print(type(my_text))

num1=5
num2=15

print(num1+num2)

first_name=("mariami")
last_name=("jalaghonia")

print(first_name + last_name)

age=8
new_age=9

print(new_age)

# შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე

str_num=10

print(int(str_num )* 6)


#შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.

num1=4
num2=5
num3=12
num4=9
num5=34

print(num1 + num2 + num3 + num4 +num5 )

print(64/5)
 


