# 1) იმუშავეთ .apped ფუნქციაზე და დაწერეთ 5-5  მაგალითები


# names=["mariam","michelle","isaac"]

# names.append("chinyere")

# print(names)

# 2) იმაშავეთ .remove ფუნქციაზე და დაწერეათ 5-5 მაგალითი


# lis = ['a', 'b', 'c']
# lis.remove("b")
# print(lis)




# 3) იმუშავეთ .pop ფუნქციაზე და დაწერეთ 5-5 მაგალითი

# a = [10, 20, 30, 40]

# a.pop()

# print(a)




# 4) იმუშავეთ .insert გუნქციაზე და დაწერეთ 5-5 მაგალითი


# fruit = ["banana","cherry","grape"]
# fruit.insert(1,"apple")
# print(fruit)





# 5) იმუშავეთ  .extend  გუნქციაზე და დაწერეთ 5-5 მაგალითი

# cars = ["Audi","BMW","Jaguar"]
# other_cars = ["Maruti", "Tata"]
# cars.extend(other_cars)
# print(cars)




# 6)იმუშავეთ  .index    გუნქციაზე და დაწერეთ 5-5 მაგალითი


# Animals= ["cat", "dog", "tiger"]
# print(Animals.index("dog"))





# 7) იმუშავეთ .len გუნქციაზე და დაწერეთ 5-5 მაგალითი


# mylist = ["apple", "banana", "cherry"]
# x = len(mylist)



# 8)  იმუშავეთ .icount გუნქციაზე და დაწერეთ 5-5 მაგალითი

# a = [1, 2, 3, 1, 2, 1, 4]

# c = a.count(1)

# print(c)

# 15
# 15
# 16
# 16
# 16
# 16
# 16
# 16
# 15
# 17
# 17
# 17
# 17
# 19
# 21
# 21
# 23
# 25
# 25
# 26
# 32 

# ეს არის თქვენი ჯგუფის წევრების ასაკები, 

# დავალება:

# შექმენით პროგრამა რომელიც გამოითვლის ჯგუფის საშუალო ასაკს.
#  
# ასევე გამოითვალეთ ყველაზე ხშირად რომელი ასაკი გვხვდება


# გიწერთ დამათებით დავალებებს აუცილებლად შეასრულეთ ყველა 





# ```

# 2)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი არ გამოიყენოთ count ფუნქცია 
# 3)  შექმენით პროგრამა რომელიც დაითვლის სიაში რამდენჯერ მეორდება თქვენი სახელი გამოიყენეთ count ფუნქცია
# 4) შექმენით სია რომელშიც იქნება რენდომ რიცხვები მოთავსებული შემდეგ კი შექმენით მეორე სია რომელშიც გადაიტანთ პირველი სიიდან მხოლოდ ლუწ რიცხვებს


list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

even = []
for i in list:
    if i % 2 == 0: 
        even.append(i)
print(even)

    




# 5) შექმენით სია რომელშიც იქნება მოთავსებული რენდომ რიცხვები შემდეგ კი ამ სიიდან ამოშალეთ ყველა ლუწი რიცხვი






# 6) შექმენით სია რომელშიც იქნება სახელები შემდეგ კი შექმენით პროგრამა რომელიც ამოშლის ყველა სახელს რომელიც "t" ასოზე იწყება და ჩაამატებს ახალ სიაში